
/**
 * @邻接矩阵
 * n*n矩阵
 * 无向：关于左下对角对称的是无向图
 * 有向：只有一半对角有非0元素
 * 无权：只有0，1
 * 
 */
// 无向无权重
let g1 =
    [[0, 1, 1, 0, 0],
    [1, 0, 0, 1, 1],
    [1, 0, 0, 1, 0],
    [0, 1, 1, 0, 1],
    [0, 1, 0, 1, 0]]

// 有向无权重
let g2 =
    [[0, 1, 1, 0, 0],
    [0, 0, 0, 1, 1],
    [0, 0, 0, 1, 0],
    [0, 0, 0, 0, 1],
    [0, 0, 0, 0, 0]]

// 有向有权重
let g3 =
    [[0, 2, 4, 0, 0],
    [0, 0, 0, 1, 1],
    [0, 0, 0, 7, 0],
    [0, 0, 0, 0, 1],
    [0, 0, 0, 0, 0]]




/**
 * @邻接表
 */
/**
 * 有向无环 带权图
 */
let edges = [[0, 1, 5], [1, 3, 10], [0, 2, 3], [2, 3, 4]]
//转gragh对象格式
let gragh1 = {}
for (const [k, v, weight] of edges) {
    if (!gragh1[k]) { gragh1[k] = {} }
    gragh1[k][v] = weight
}
//console.log(gragh1) //{ '0': { '1': 5, '2': 3 }, '1': { '3': 10 }, '2': { '3': 4 } }

/**
 * 有环 带权图
 */
let g4 = {
    A: { B: 1, C: 4 },
    B: { A: 1, C: 2, D: 5 },
    C: { A: 4, B: 2, D: 1 },
    D: { B: 5, C: 1 }
};

/**
 * 有环无权
 */
let g5 = {
    A: ['B', 'C'],
    B: ['A', 'C', 'D'],
    C: ['A', 'B', 'D'],
    D: ['B', 'C']
}

export { g1, g2, g3, g4, g5, gragh1 }

